# Concatenación de dataframes

Concatenar == juntar, unir o fusionar

Para dataframes, existen 3 formas de concatenar:
- Concat (concatenar)
- Merge (fusionar)
- Join (unir)

# Concat
Esta técnica se centra en bases de datos comunes , que tienen las mismas columnas y por tanto hay que juntar las filas

In [2]:
import pandas as pd

In [16]:
df1= pd.DataFrame({'A':['1A', '2A'],'B':['1B','2B'], 'C':['1C','2C'],'K':['1K','2K']})
df2= pd.DataFrame({'A':['6A','7A','8A'],'B':['6B', '7B', '8B'],'C':['6C', '7C', '8C']})

In [17]:
df1

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [18]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [19]:
pd.concat([df1,df2])

    A   B   C    K
0  1A  1B  1C   1K
1  2A  2B  2C   2K
0  6A  6B  6C  NaN
1  7A  7B  7C  NaN
2  8A  8B  8C  NaN

In [20]:
pd.concat([df1,df2],ignore_index=True)

    A   B   C    K
0  1A  1B  1C   1K
1  2A  2B  2C   2K
2  6A  6B  6C  NaN
3  7A  7B  7C  NaN
4  8A  8B  8C  NaN

# Merge 
#### (Fusión)
Esta técnica fusiona diferentes data frames a partir de una columna (clave) en comun

In [32]:
df1= pd.DataFrame({'A':['1A', '2A','3A'],'B':['1B','2B','3B']})
df2= pd.DataFrame({'A':['5A', '6A'], 'C':['1C','2C'],'K':['1K','2K']})

In [33]:
df1

    A   B
0  1A  1B
1  2A  2B
2  3A  3B

In [34]:
df2

    A   C   K
0  5A  1C  1K
1  6A  2C  2K

In [35]:
pd.merge(df1,df2, on=['A'], how='left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3B  NaN  NaN

# Join
La idea de este dataframe es combinar las columnas de dos dataframes indexados

In [41]:
df1= pd.DataFrame({'Z':['1A', '2A','3A'],'B':['1B','2B','3B']}, index=['i1','i2','i3'])
df2= pd.DataFrame({'A':['5A', '6A'], 'C':['1C','2C'],'K':['1K','2K']}, index=['i1','i2'])

In [42]:
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3B

In [43]:
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [45]:
df3= df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

# Entradas y salidas

In [46]:
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [48]:
df3.to_csv('nombre.csv', index= False)

In [50]:
pd.read_csv('otra cosa.csv')

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN

In [52]:
pd.read_csv(r"C:\Users\Luz María\OneDrive\Escritorio\Neurociencias-2026-1\S02_clases\clase_09_29\afuera.csv")

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN